# 1. Python Basics
* If Statements
* For/While Loops
* Lists

## 1.1 If Statements

Booleans in Python are capitalized; we don't really specify datatypes for most of Python

In [1]:
am_hungry = True
if am_hungry:
  print("I am hungry!")
else:
  print("I am not hungry")

I am hungry!

In [2]:
x = 5

In [3]:
x = x + 2

In [4]:
x

7

In [5]:
number = 17
if number < 15:
  print("Number less than 15")
elif number > 17:
  print("Number is greater than 17")
else:
  print("Number must be between 15 and 17 inclusive")

Number must be between 15 and 17 inclusive

## 1.2 For/While Loops

### For Loop

The general syntax is:
```
for <item> in <collection>
  <statement>
```

We can also do something like:
```
for <i> in <range()>
  <do something>
```

However:
- If you can, avoid this!
- This is very slow when working over dataframe rows, which we'll cover later in this recitation as well! :)

In [6]:
fruits = ['Bananas', 'Apples', 'Pears', 'Grape']
for element in fruits:
  print(element)

Bananas
Apples
Pears
Grape

In [7]:
# can call item in anything (same output as above)
for beep_boop in fruits:
  print(beep_boop)

Bananas
Apples
Pears
Grape

In [8]:
# range(i) is a type of iterable that returns a sequence of numbers from 0 to i by default
for i in range(5):
  print(i)

for i in range(len(fruits)):
  print(i)
  print(fruits[i])

0
1
2
3
4
0
Bananas
1
Apples
2
Pears
3
Grape

### While Loop
Like in other languages, the loop executes until a condition is met.

In [9]:
i = 0
while i < len(fruits):
  print(fruits[i])
  i += 1

Bananas
Apples
Pears
Grape

## 1.3 Lists
Lists (and more generally all sequence and dictionary types) have the functions of:
* `append`
* `insert`
* `index`
* `count`
* `remove`

Use `len(arr)` to determine the length of the list `arr`.

In [10]:
# can modify values of a list in place
simple = [1, 2, 3]

# task: how do we make this into [2, 3, 4] using a loop?
# for i in range(len(simple)):
#   simple[i] += 1

print(simple)

[1, 2, 3]

#### List Comprehension
A cool and extremely useful feature of Python! Good for condensing code using loops and conditionals. 

The general syntax is:

```
[ <expression> for <name> in <list> if <filter> ]
```

List comprehension also applies to dictionaries and sets, as follows.

```
{ <expression> for <key>, <value> in <dict> if <filter> }
```

In [11]:
# using list comprehension
simple = [1, 2, -4, 3, -1]
new_simple = [elem + 1 for elem in simple if elem > 0]
print(new_simple)

[2, 3, 4]

# 2. Pandas Basics
* Series and DataFrames
* Variables
* Apply
* Merge Operations
* Missing Data and Data Cleaning

## Installation

In [12]:
!pip install pandas
!pip install numpy

Collecting pandas
  Using cached pandas-1.5.3-cp39-cp39-macosx_10_9_x86_64.whl (12.0 MB)
Collecting pytz>=2020.1
  Using cached pytz-2022.7.1-py2.py3-none-any.whl (499 kB)
Collecting numpy>=1.20.3
  Downloading numpy-1.24.2-cp39-cp39-macosx_10_9_x86_64.whl (19.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 19.8/19.8 MB 29.0 MB/s eta 0:00:0000:0100:01
Requirement already satisfied: python-dateutil>=2.8.1 in /Users/hanying/miniconda3/envs/cheatsheet/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/hanying/miniconda3/envs/cheatsheet/lib/python3.9/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.24.2 pandas-1.5.3 pytz-2022.7.1
Requirement already satisfied: numpy in /Users/hanying/miniconda3/envs/cheatsheet/lib/python3.9/site-packages (1.24.2)

In [13]:
# import pandas and numpy
import pandas as pd
import numpy as np

## 2.1 Series and DataFrames

* **Series:** one-dimensional array with hashable axis labels. Parameter is an iterable array-like object, such as lists, dicts, etc.
* **DataFrame:** two-dimensional, size-mutable tabular data, consisting of columns of Series. Parameter is an array-like object or DataFrame.

In [14]:
sports = pd.Series(['football', 'basketball',' volleyball','tennis'])

population = pd.Series({'Germany': 81.3, 'Belgium': 11.3, 'France': 64.3, 
                        'United Kingdom': 64.9, 'Netherlands': 16.9})

countries = pd.DataFrame({'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']})

In [15]:
sports

0       football
1     basketball
2     volleyball
3         tennis
dtype: object

In [16]:
population

Germany           81.3
Belgium           11.3
France            64.3
United Kingdom    64.9
Netherlands       16.9
dtype: float64

In [17]:
countries

          country  population    area    capital
0         Belgium        11.3   30510   Brussels
1          France        64.3  671308      Paris
2         Germany        81.3  357050     Berlin
3     Netherlands        16.9   41526  Amsterdam
4  United Kingdom        64.9  244820     London

In [18]:
# Each column in a dataframe is a Series
# Check it out here: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html
type(population)

pandas.core.series.Series

In [19]:
population.index

Index(['Germany', 'Belgium', 'France', 'United Kingdom', 'Netherlands'], dtype='object')

In [20]:
population['Belgium']

11.3

In [21]:
population.values

array([81.3, 11.3, 64.3, 64.9, 16.9])

In [22]:
population/100

Germany           0.813
Belgium           0.113
France            0.643
United Kingdom    0.649
Netherlands       0.169
dtype: float64

In [23]:
type(countries)

pandas.core.frame.DataFrame

In [24]:
countries

          country  population    area    capital
0         Belgium        11.3   30510   Brussels
1          France        64.3  671308      Paris
2         Germany        81.3  357050     Berlin
3     Netherlands        16.9   41526  Amsterdam
4  United Kingdom        64.9  244820     London

To access dataframe variables, use the `.` operator or brackets `[ ]`, or access multiple columns with `[[ ]]`

In [25]:
type(countries.area)

pandas.core.series.Series

In [26]:
countries['area']

0     30510
1    671308
2    357050
3     41526
4    244820
Name: area, dtype: int64

In [27]:
# What's the difference if we use the double braces, i.e.: 
# Explore and see! :)
countries[['area']]

     area
0   30510
1  671308
2  357050
3   41526
4  244820

We can also access dataframes using conditional operators, such as:

In [28]:
# Extract data for UK/London
countries[countries.capital == 'London']

          country  population    area capital
4  United Kingdom        64.9  244820  London

In [29]:
# We can also do this without the .
countries[countries['capital'] == 'London']

          country  population    area capital
4  United Kingdom        64.9  244820  London

In [30]:
# Now use inequalities: get all countries with area > 100k!
countries[countries['area'] > 100000]

          country  population    area capital
1          France        64.3  671308   Paris
2         Germany        81.3  357050  Berlin
4  United Kingdom        64.9  244820  London

## 2.2 Creating New Variables
Adding columns to the DataFrame!

In [31]:
# basic assignment
countries['newVar'] = [1,2,3,4,5]
countries

          country  population    area    capital  newVar
0         Belgium        11.3   30510   Brussels       1
1          France        64.3  671308      Paris       2
2         Germany        81.3  357050     Berlin       3
3     Netherlands        16.9   41526  Amsterdam       4
4  United Kingdom        64.9  244820     London       5

In [32]:
# using existing columns for assignment
countries['newVar'] = countries.population * 2  + countries.area**0.5
countries

          country  population    area    capital      newVar
0         Belgium        11.3   30510   Brussels  197.271120
1          France        64.3  671308      Paris  947.933876
2         Germany        81.3  357050     Berlin  760.136610
3     Netherlands        16.9   41526  Amsterdam  237.579292
4  United Kingdom        64.9  244820     London  624.592886

## 2.3 Apply

Apply is a very powerful method which can be used for making major data manipulation tasks. Much faster than standard for loops because of internal optimizations. 

NOTE: Your code may never finish running if you use for loops due to the size of the datasets!

In [33]:
%%timeit

countries = pd.DataFrame({'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']})

for index, row in countries.iterrows():
  row['capital'].upper()

617 µs ± 31.6 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [34]:
 %%timeit

countries = pd.DataFrame({'country': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 41526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']})

countries['capital'] = countries['capital'].apply(lambda x : x.upper())
countries

610 µs ± 34.4 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [35]:
def ageBucket(x):
    if x<18:
        return "A. <18"
    elif x<25:
        return "B. 18-25"
    elif x<45:
        return "C. 25-45"
    else:
        return "D. >45"

In [36]:
df = pd.DataFrame({'Age': [1, 2, 19, 39, 50]})
df

   Age
0    1
1    2
2   19
3   39
4   50

Apply can be used on a single column (ie on a Series object).

In [37]:
df['AgeBucket'] = df['Age'].apply(ageBucket)
df.head()

   Age AgeBucket
0    1    A. <18
1    2    A. <18
2   19  B. 18-25
3   39  C. 25-45
4   50    D. >45

Apply can also be used on an entire dataframe.

In [38]:
df['AgeBucket2'] = df.apply(lambda x : ageBucket(x['Age']),axis=1)
df.head()

   Age AgeBucket AgeBucket2
0    1    A. <18     A. <18
1    2    A. <18     A. <18
2   19  B. 18-25   B. 18-25
3   39  C. 25-45   C. 25-45
4   50    D. >45     D. >45

Other derivative methods that you can look into are `map` and `applymap`.
* `map` works only on Series but has the same functionality as `apply`.
* `applymap` applies to every element excluding the target column.

## 2.4 Merge Operations

Merging with Pandas works pretty much the same as SQL. **There are four merge methods:**
1. Left
2. Right
3. Inner 
4. Outer

This is further demonstrated by the venn diagram below.

![join-venn-diagram](https://i.stack.imgur.com/UI25E.jpg)

**Basic Syntax:**

`pd.merge(left_dataframe, right_dataframe, left_on="some_column", right_on="some_column", how="left|right|inner|outer)`

In [39]:
population = pd.DataFrame({'country': ['Germany', 'Belgium', 'France', 
                        'United Kingdom', 'United States'],'population': [81.3, 11.3, 64.3, 64.9, 65.9]})

countries = pd.DataFrame({'country2': ['Belgium', 'France', 'Germany', 'Netherlands', 'United Kingdom'],
        'population': [11.3, 64.3, 81.3, 16.9, 64.9],
        'area': [30510, 671308, 357050, 1526, 244820],
        'capital': ['Brussels', 'Paris', 'Berlin', 'Amsterdam', 'London']})

In [40]:
population

          country  population
0         Germany        81.3
1         Belgium        11.3
2          France        64.3
3  United Kingdom        64.9
4   United States        65.9

In [41]:
countries

         country2  population    area    capital
0         Belgium        11.3   30510   Brussels
1          France        64.3  671308      Paris
2         Germany        81.3  357050     Berlin
3     Netherlands        16.9    1526  Amsterdam
4  United Kingdom        64.9  244820     London

In a Left Merge we are mostly concerned with data on the LEFT side but we would like to add data from 
the RIGHT side if it has some of the same countries in this case.

In [42]:
pd.merge(left=population, right=countries, left_on="country", right_on="country2", how="left")

,country,population_x,country2,population_y,area,capital
0,Germany,81.3,Germany,81.3,357050.0,Berlin
1,Belgium,11.3,Belgium,11.3,30510.0,Brussels
2,France,64.3,France,64.3,671308.0,Paris
3,United Kingdom,64.9,United Kingdom,64.9,244820.0,London
4,United States,65.9,NaN,NaN,NaN,NaN

In a Right Merge we are mostly concerned with data on the RIGHT side but we would like to add data from 
the LEFT side if it has some of the same countries in this case.

In [43]:
pd.merge(left=population, right=countries, left_on="country", right_on="country2", how="right")

,country,population_x,country2,population_y,area,capital
0,Belgium,11.3,Belgium,11.3,30510,Brussels
1,France,64.3,France,64.3,671308,Paris
2,Germany,81.3,Germany,81.3,357050,Berlin
3,NaN,NaN,Netherlands,16.9,1526,Amsterdam
4,United Kingdom,64.9,United Kingdom,64.9,244820,London

With an Inner Merge, we chop up both dataframes and only glue the stuff that matches. If a country isn't in both 
dataframes, we don't keep it and we don't add NaN's. If no type of join is mentioned, then inner join is the 
default join.

In [44]:
# not inner merge
pd.merge(left=population, right=countries, left_on="country", right_on="country2")

,country,population_x,country2,population_y,area,capital
0,Germany,81.3,Germany,81.3,357050,Berlin
1,Belgium,11.3,Belgium,11.3,30510,Brussels
2,France,64.3,France,64.3,671308,Paris
3,United Kingdom,64.9,United Kingdom,64.9,244820,London

In [45]:
# inner merge -- notice how it only contains rows of countries that both DataFrames have
pd.merge(left=population, right=countries, left_on="country", right_on="country2", how="inner")

,country,population_x,country2,population_y,area,capital
0,Germany,81.3,Germany,81.3,357050,Berlin
1,Belgium,11.3,Belgium,11.3,30510,Brussels
2,France,64.3,France,64.3,671308,Paris
3,United Kingdom,64.9,United Kingdom,64.9,244820,London

With an Outer Merge, we chop up both dataframes and keep everything from both sides. Then we toss in NaN's to fill
any blanks.

In [46]:
# outer merge -- countries that the DataFrames don't both have are filled with NaN values
pd.merge(left=population, right=countries, left_on="country", right_on="country2", how="outer")

,country,population_x,country2,population_y,area,capital
0,Germany,81.3,Germany,81.3,357050.0,Berlin
1,Belgium,11.3,Belgium,11.3,30510.0,Brussels
2,France,64.3,France,64.3,671308.0,Paris
3,United Kingdom,64.9,United Kingdom,64.9,244820.0,London
4,United States,65.9,NaN,NaN,NaN,NaN
5,NaN,NaN,Netherlands,16.9,1526.0,Amsterdam

## 2.5 Groupby

How do we aggregate data and do computations in Python?

```
dataframe.groupby(<parameters to group>).<aggregate function>
```

The intermediate format is a "groupby" that we can call aggregate functions on and re-transform into a dataframe, for example

In [47]:
pop_countries = pd.merge(left=population[['country']], right=countries, left_on="country", right_on="country2", how="outer")
pop_countries['continent'] = pop_countries['country'].apply(lambda x: 'America' if x == 'United States' else 'Europe')
pop_countries.groupby('continent').count()

           country  country2  population  area  capital
continent
America          1         0           0     0        0
Europe           4         5           5     5        5

In [48]:
# What if we wanted to find the average population?
pop_countries.groupby('continent').mean()

/var/folders/mn/74g13wcd4sb2_jdx03rtc4m40000gp/T/ipykernel_56259/1884364163.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  pop_countries.groupby('continent').mean()

           population      area
continent
America           NaN       NaN
Europe          47.74  261042.8

In [49]:
# How about only for area for Europe, in a dataframe format? 
groupby_countries_df = pop_countries.groupby('continent')['area'].mean().to_frame()

# Option 1: to_frame
groupby_countries_df.loc['Europe'].to_frame() 
    # loc can be used to get rows
    # this returns a series which is why we have to call .to_frame() after

        Europe
area  261042.8

In [50]:
# Option 2: translate so we have the rows as columns
print(groupby_countries_df.T)
print()
groupby_countries_df.T['Europe'].to_frame() # this returns a series, since it only extracts one column, but we could call .to_frame() after

continent  America    Europe
area           NaN  261042.8

        Europe
area  261042.8

In [51]:
groupby_countries_df.T[['Europe']].T # this returns a df by default; we can use .T to transform it back to the original format

               area
continent
Europe     261042.8

There's a lot of other formatting things that we can examine, such as how to transform things from a `groupby` form, the aggregated dataframe, or a standard dataframe with a numerical index. Take a look at the `reset_index` function [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.reset_index.html) -- do you think we should have `drop = True` or `drop = False` here?

In [52]:
# Now how do we get the contents back to a column?
groupby_countries_df.reset_index(drop = False)

  continent      area
0   America       NaN
1    Europe  261042.8

## 2.6 Missing Data
How to handle missing data (`NaN`'s)? Most common commands used are `fillna` and `dropna`.

In [53]:
missing_df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'],columns=['one', 'two', 'three'])
missing_df['four'] = 'bar'
missing_df['five'] = missing_df['one'] > 0
missing_df.loc[['a','c','h'],['one','four']] = np.nan
missing_df

        one       two     three four   five
a       NaN -1.231781  2.734106  NaN   True
c       NaN -0.202867 -0.188090  NaN   True
e -0.651561 -0.032076  0.257099  bar  False
f  1.407802 -1.447381 -0.541138  bar   True
h       NaN  1.211829 -0.255142  NaN   True

In [54]:
# fillna replaces NA/NaN values with the given value in the command.
missing_df.fillna(0)

        one       two     three four   five
a  0.000000 -1.231781  2.734106    0   True
c  0.000000 -0.202867 -0.188090    0   True
e -0.651561 -0.032076  0.257099  bar  False
f  1.407802 -1.447381 -0.541138  bar   True
h  0.000000  1.211829 -0.255142    0   True

In [55]:
missing_df['one'] = missing_df['one'].fillna('missing')

In [56]:
missing_df.dtypes

one       object
two      float64
three    float64
four      object
five        bool
dtype: object

`dropna` is used to drop the rows or columns with NA/NaN values.

**`dropna` Usage:**
* `axis` argument determines if rows or columns which contain missing values are removed.
* `axis = 0`: Drop rows which contain missing values.
* `axis = 1`: Drop columns which contain missing value.
* `how` argument determines if row or column is removed from DataFrame, when we have at least one NA or all NA.
* `how = any`: If any NA values are present, drop that row or column. (default)
* `how = all` : If all values are NA, drop that row or column.

In [57]:
missing_df.dropna(axis=0)

        one       two     three four   five
e -0.651561 -0.032076  0.257099  bar  False
f  1.407802 -1.447381 -0.541138  bar   True

In [58]:
temp_df = missing_df.dropna(axis=1)

In [59]:
temp_df

        one       two     three   five
a   missing -1.231781  2.734106   True
c   missing -0.202867 -0.188090   True
e -0.651561 -0.032076  0.257099  False
f  1.407802 -1.447381 -0.541138   True
h   missing  1.211829 -0.255142   True

In [60]:
missing_df['six'] = [1, 2, 3, 4, 5]
missing_df

        one       two     three four   five  six
a   missing -1.231781  2.734106  NaN   True    1
c   missing -0.202867 -0.188090  NaN   True    2
e -0.651561 -0.032076  0.257099  bar  False    3
f  1.407802 -1.447381 -0.541138  bar   True    4
h   missing  1.211829 -0.255142  NaN   True    5

In [61]:
missing_df.dropna(axis=1, how = 'all')

        one       two     three four   five  six
a   missing -1.231781  2.734106  NaN   True    1
c   missing -0.202867 -0.188090  NaN   True    2
e -0.651561 -0.032076  0.257099  bar  False    3
f  1.407802 -1.447381 -0.541138  bar   True    4
h   missing  1.211829 -0.255142  NaN   True    5

In [62]:
# dropping rows only where some columns are missing
missing_df.dropna(subset = ['two', 'four'])

        one       two     three four   five  six
e -0.651561 -0.032076  0.257099  bar  False    3
f  1.407802 -1.447381 -0.541138  bar   True    4

In [63]:
# what happens if we call the above for column 'two' and 'five'?
missing_df.dropna(subset = ['two', 'five'])

        one       two     three four   five  six
a   missing -1.231781  2.734106  NaN   True    1
c   missing -0.202867 -0.188090  NaN   True    2
e -0.651561 -0.032076  0.257099  bar  False    3
f  1.407802 -1.447381 -0.541138  bar   True    4
h   missing  1.211829 -0.255142  NaN   True    5